euyju/VibeClean/HW/STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>    // printf, sprintf 사용을 위해
#include <stdarg.h>   // 가변 인자 사용을 위해
#include <math.h>
#include "ESP8266_HAL.h"
#include <string.h>   // strlen 사용을 위해
#include "stm32f4xx_hal.h" // HAL 함수 사용을 위해
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
// HC-SR04 핀 정의
#define TRIG_PIN    GPIO_PIN_0
#define TRIG_PORT    GPIOC
#define ECHO_PIN    GPIO_PIN_1
#define ECHO_PORT    GPIOA

#define TRIG_PIN1    GPIO_PIN_1
#define TRIG_PORT1    GPIOC
#define ECHO_PIN1    GPIO_PIN_8
#define ECHO_PORT1    GPIOB

#define TRIG_PIN2    GPIO_PIN_2
#define TRIG_PORT2    GPIOC
#define ECHO_PIN2    GPIO_PIN_10
#define ECHO_PORT2    GPIOB

uint8_t rx_data[100];


// 클럭 설정 (SystemClock_Config 기준 HCLK = 84MHz)
// 1초 = 84,000,000 사이클 -> 1us = 84 사이클
#define DWT_DELAY_UNIT (HAL_RCC_GetHCLKFreq() / 1000000)

// HC-SR04 관련 상수
#define SOUND_SPEED_CM_PER_US 0.0343 // 음속: 343m/s = 0.0343 cm/us
#define MAX_TIMEOUT_US 30000 // 30ms (HC-SR04 최대 측정 거리 고려)



// 모터 1 (A) - ENA: TIM1_CH1 (PA8)
// 방향 핀
#define M1_IN1_PORT GPIOB
#define M1_IN1_PIN  GPIO_PIN_0
#define M1_IN2_PORT GPIOB
#define M1_IN2_PIN  GPIO_PIN_1

// 모터 2 (B) - ENB: TIM1_CH2 (PA9)
// 방향 핀
#define M2_IN1_PORT GPIOB
#define M2_IN1_PIN  GPIO_PIN_2
#define M2_IN2_PORT GPIOB
#define M2_IN2_PIN  GPIO_PIN_12

// 모터 3 (A) - ENA: TIM4_CH1 (Pb6)
#define M3_IN1_PORT GPIOC
#define M3_IN1_PIN  GPIO_PIN_3
#define M3_IN2_PORT GPIOC
#define M3_IN2_PIN  GPIO_PIN_4


// 모터 ID 및 방향 정의
#define MOTOR_A     1
#define MOTOR_B     2
#define MOTOR_C     3


#define FORWARD     1
#define BACKWARD    2
#define RIGHT    3 // 우회전
#define LEFT      4 // 좌회전 (필요시)
#define STOP        0

// PWM 최대값 (CubeMX TIM1 ARR 설정에 따라 변경될 수 있음. 여기서는 1000 가정)
#define PWM_MAX_VALUE 1000

// 벽 감지 임계 거리 (센티미터 단위)
#define WALL_DISTANCE_THRESHOLD 30.0f
// 직진 속도 및 회전 속도 (PWM 값)
#define BASE_SPEED          300
#define TURN_SPEED          300
// 회전 시간 상수 (90도 회전에 필요한 시간, 보정 필요)
#define TURN_90_TIME_MS     3200 // (모터와 바퀴에 따라 크게 달라짐)
// 유턴 시 전진/후진 거리 시간 (본체 폭만큼 이동하기 위한 시간, 보정 필요)
#define BODY_MOVE_TIME_MS   800 // 예시 값 (본체 폭에 따라 조절)

#define MPU6050_ADDR  (0x68 << 1)
#define PWR_MGMT_1    0x6B
#define ACCEL_XOUT_H  0x3B

//Odometry 상수
#define WHEEL_RADIUS_MM     30      // 바퀴 반지름 (mm)
#define ROBOT_AXLE_LENGTH_MM 160    // 바퀴 축 간 거리 (mm)
#define ENCODER_RESOLUTION  1000    // 엔코더 해상도 (펄스 수)
#define TIMER_PERIOD        65536   // TIM3/TIM8 주기

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim8;

UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
TIM_HandleTypeDef htim2;
//2D 맵핑용 위치변수
float g_robot_x = 0.0f;     // 현재의 X 좌표
float g_robot_y = 0.0f;     // 현재의 Y 좌표
float g_robot_yaw = 0.0f;   // 현재의 방향 각도 (단위: 도 Degree)
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM4_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM8_Init(void);
/* USER CODE BEGIN PFP */
void DWT_Init(void);
void DWT_Delay_us(uint32_t us);
float HCSR04_Read(GPIO_TypeDef *trigPort, uint16_t trigPin,
                  GPIO_TypeDef *echoPort, uint16_t echoPin);
void UART_Printf(const char *format, ...);







/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/**
  * @brief DWT (Data Watchpoint and Trace) 초기화 함수
  * @retval None
  */
void DWT_Init(void) {
    // TRCENA 활성화 (DWT 활성화)
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    // CYCCNT 카운터 초기화
    DWT->CYCCNT = 0;
    // CYCCNT 카운터 활성화
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

/**
  * @brief DWT 기반 마이크로초 지연 함수
  * @param us: 지연할 마이크로초
  * @retval None
  */
void DWT_Delay_us(uint32_t us) {
    uint32_t start_tick = DWT->CYCCNT;
    uint32_t delay_ticks = us * DWT_DELAY_UNIT;
    while ((DWT->CYCCNT - start_tick) < delay_ticks);
}

/**
  * @brief UART2를 이용한 printf 함수
  * @param format: 출력 형식 문자열
  * @retval None
  */
void UART_Printf(const char *format, ...) {
    char str[100];
    va_list args;
    va_start(args, format);
    vsprintf(str, format, args);
    va_end(args);
    // UART 전송 (Blocking 모드)
    HAL_UART_Transmit(&huart2, (uint8_t *)str, strlen(str), HAL_MAX_DELAY);
}

/**
  * @brief HC-SR04 거리 측정 함수
  * @retval 측정 거리 (cm), 실패 시 -1.0
  */
float HCSR04_Read(GPIO_TypeDef *trigPort, uint16_t trigPin,
                  GPIO_TypeDef *echoPort, uint16_t echoPin)
{
    uint32_t start_time, end_time, duration_cycles;

    HAL_GPIO_WritePin(trigPort, trigPin, GPIO_PIN_RESET);
    DWT_Delay_us(2);

    HAL_GPIO_WritePin(trigPort, trigPin, GPIO_PIN_SET);
    DWT_Delay_us(10);
    HAL_GPIO_WritePin(trigPort, trigPin, GPIO_PIN_RESET);

    start_time = DWT->CYCCNT;
    while (HAL_GPIO_ReadPin(echoPort, echoPin) == GPIO_PIN_RESET) {
        if ((DWT->CYCCNT - start_time) > (MAX_TIMEOUT_US * DWT_DELAY_UNIT))
            return -1.0f;
    }

    start_time = DWT->CYCCNT;
    while (HAL_GPIO_ReadPin(echoPort, echoPin) == GPIO_PIN_SET) {
        if ((DWT->CYCCNT - start_time) > (MAX_TIMEOUT_US * DWT_DELAY_UNIT))
            return -1.0f;
    }

    end_time = DWT->CYCCNT;
    duration_cycles = end_time - start_time;

    float distance = ((float)duration_cycles / (float)DWT_DELAY_UNIT)
                     * SOUND_SPEED_CM_PER_US / 2.0f;

