euyju/VibeClean/HW/STM32/Core/Src/main.c
	    // 2. 카운터 변화량 계산 (Delta Pulse) - 랩어라운드 처리 적용
	    int delta_L_pulse = current_enc_L - prev_enc_L;
	    int delta_R_pulse = current_enc_R - prev_enc_R;

	    //  랩어라운드 처리
	    if (delta_L_pulse > (PERIOD / 2)) {
	        delta_L_pulse -= PERIOD; // 언더플로우 발생 시
	    } else if (delta_L_pulse < -(PERIOD / 2)) {
	        delta_L_pulse += PERIOD; // 오버플로우 발생 시
	    }

	    if (delta_R_pulse > (PERIOD / 2)) {
	        delta_R_pulse -= PERIOD;
	    } else if (delta_R_pulse < -(PERIOD / 2)) {
	        delta_R_pulse += PERIOD;
	    }

	    prev_enc_L = current_enc_L;
	    prev_enc_R = current_enc_R;

	    // 3. 펄스 변화량을 실제 이동 거리(mm)로 변환
	    float distance_L_mm = (float)delta_L_pulse / ENCODER_RESOLUTION * (2.0f * PI * WHEEL_RADIUS_MM);
	    float distance_R_mm = (float)delta_R_pulse / ENCODER_RESOLUTION * (2.0f * PI * WHEEL_RADIUS_MM);

	    // 평균 이동 거리 및 각도 변화 계산
	    float distance_center_mm = (distance_R_mm + distance_L_mm) / 2.0f;
	    float delta_theta_rad = (distance_R_mm - distance_L_mm) / ROBOT_AXLE_LENGTH_MM; // 회전 각도(라디안)


	    // 4. 좌표 (X, Y) 및 방향 (Yaw) 업데이트 (Middle Point 적분 방식 적용)

	    // 4-1. 현재 Yaw를 라디안으로 변환
	    float current_yaw_rad = g_robot_yaw * PI / 180.0f;

	    // 4-2. 중간 각도 (Average Yaw) 계산: X, Y 계산에 사용 (정확도 향상)
	    float avg_yaw_rad = current_yaw_rad + delta_theta_rad / 2.0f;

	    // 4-3. X, Y 좌표 업데이트
	    float delta_x = distance_center_mm * cosf(avg_yaw_rad);
	    float delta_y = distance_center_mm * sinf(avg_yaw_rad);

	    g_robot_x += delta_x;
	    g_robot_y += delta_y;

	    // 4-4. Yaw 각도 업데이트 및 정규화
	    float next_yaw_rad = current_yaw_rad + delta_theta_rad;
	    g_robot_yaw = next_yaw_rad * 180.0f / PI;

	    // Yaw 각도 정규화 (0~359.999도)
	    while (g_robot_yaw >= 360.0f) g_robot_yaw -= 360.0f;
	    while (g_robot_yaw < 0.0f) g_robot_yaw += 360.0f;
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
//	//**Putty에서 작동 확인용
//	int countL, countR; //  엔코더 카운트 저장 변수
	char debug_msg[100]; // 디버깅 메시지 버퍼
//	//
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_TIM2_Init();
  MX_TIM1_Init();
  MX_TIM4_Init();
  MX_I2C1_Init();
  MX_USART3_UART_Init();
  MX_TIM3_Init();
  MX_TIM8_Init();
  /* USER CODE BEGIN 2 */
  // DWT 초기화 (마이크로초 측정을 위해 필수)
  DWT_Init();
  UART_Printf("STM32 HC-SR04 Measurement Ready (Trig: PA0, Echo: PA1)\r\n");


  motor_control_init(); // <- 반드시 호출 (PWM Start + 초기화)
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);

  //엔코더 카운팅 시작
  HAL_TIM_Encoder_Start(&htim3, TIM_CHANNEL_ALL);
  HAL_TIM_Encoder_Start(&htim8, TIM_CHANNEL_ALL);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  int failCount = 0;
  int tempAovoid = 0; // 0 = right, 1 = left

  char post_data_buffer[150]; //json 문자열 버퍼

////  MPU6050_Init();
//
//  float d1, d2, d3;
//  int16_t Ax, Ay, Az;
//  char buf[100];
//  // 1️⃣ Wi-Fi 연결
//     ESP_Init("YOUR_WIFI_SSID", "YOUR_WIFI_PASSWORD");
//     char value[64];  // 서버로부터 받은 값을 저장할 버퍼
//
//     // 2️⃣ GET 요청 및 값 파싱
//     if (ESP_HTTP_Get_Value("192.168.178.61", "/api/manual/speed", "fanSpeed", value))
//     {
//         char msg[128];
//         sprintf(msg, "fanSpeed value = %s\r\n", value);
//         Uart_sendstring(msg, &huart2);
//     }
//     else
//     {
//         Uart_sendstring("HTTP GET Failed\r\n", &huart2);
//     }
//
//  // POST
//  ESP_HTTP_Post("192.168.178.61", "/data", "{\"id\":1,\"value\":42}");
//
//  float distance1, distance2, distance3;


  while (1)
  {
//***	  //x,y 좌표 확인 테스트 코드
	      // 1. 오도메트리 업데이트 (현재 X, Y, Yaw 계산)
	      update_odometry();

	      // 2. 시리얼 포트로 X, Y 좌표 출력 (테스트용)
	      // float 값을 소수점 두 자리까지 출력하여 정확도를 확인합니다.
	      sprintf(debug_msg, "X: %.2f | Y: %.2f | Yaw: %.1f\r\n",
	              g_robot_x, g_robot_y, g_robot_yaw);
	      UART_Printf(debug_msg);
	      HAL_Delay(5000); // ms마다 업데이트 확인

//***	  // 1. 엔코더 카운터 값 읽기 테스트 코드
//	      countL = (int)__HAL_TIM_GET_COUNTER(&htim3); // 왼쪽 엔코더
//	      countR = (int)__HAL_TIM_GET_COUNTER(&htim8); // 오른쪽 엔코더
//
//	      // 2. 시리얼 포트로 출력 (UART_Printf 함수 사용)
//	      sprintf(debug_msg, "L: %d | R: %d\r\n", countL, countR);
//	      UART_Printf(debug_msg);
//
//	      // 3. 지연
//***	  HAL_Delay(100); // 100ms마다 업데이트



//	  		  HAL_Delay(5000);  // 5초마다 재요청 가능
//	          ESP_HTTP_Get_Value("192.168.178.61", "/api/manual/speed", "fanSpeed", value);
//
//	          char msg[128];
//	          sprintf(msg, "fanSpeed = %s\r\n", value);
//	          Uart_sendstring(msg, &huart2);
//
//	          // 1. 오도메트리 업데이트 (좌표 계산)
//	              update_odometry();
//
//	          // 2. 백엔드로 보낼 JSON 데이터 생성
//	              int x_int = (int)roundf(g_robot_x);
//	              int y_int = (int)roundf(g_robot_y);
//
//	          // JSON 형식으로 포맷팅
//	              sprintf(post_data_buffer,
//	                      "{\"robotId\":1,\"x\":%d,\"y\":%d}",
//	                      x_int, y_int);
//
//	          // 3. POST 요청으로 서버에 데이터 전송
//	              ESP_HTTP_Post("192.168.178.61", "/api/robot/location", post_data_buffer);
//
//	          // 4. 전송 주기 설정
//	              HAL_Delay(100); // 100ms (0.1초) 주기로 전송
//
//
//     MPU6050_Read_Accel(&Ax, &Ay, &Az);
//
//         // g 단위 변환
//         float ax_g = Ax / 16384.0f;
//         float ay_g = Ay / 16384.0f;
//         float az_g = Az / 16384.0f;
//
//         // Roll / Pitch 계산
//         float roll  = atan2f(ay_g, az_g) * 180.0f / 3.14159265f;
//         float pitch = atan2f(-ax_g, sqrtf(ay_g*ay_g + az_g*az_g)) * 180.0f / 3.14159265f;
//
//         // UART로 출력
//         char buf[100];
//         sprintf(buf, "Roll: %.2f  Pitch: %.2f\r\n", roll, pitch);
//         HAL_UART_Transmit(&huart2, (uint8_t*)buf, strlen(buf), 1000);
//
//         HAL_Delay(500);
     // 전진 유지
//     move_forward_pwm(BASE_SPEED);
//
//         d1 = HCSR04_Read(TRIG_PORT, TRIG_PIN, ECHO_PORT, ECHO_PIN);
//         DWT_Delay_us(5000);
//         d2 = HCSR04_Read(TRIG_PORT1, TRIG_PIN1, ECHO_PORT1, ECHO_PIN1);
//         DWT_Delay_us(5000);
//         d3 = HCSR04_Read(TRIG_PORT2, TRIG_PIN2, ECHO_PORT2, ECHO_PIN2);
//
//         UART_Printf("S1: %.1f cm | S2: %.1f cm | S3: %.1f cm\r\n", d1, d2, d3);
//
//         // 센서값 모두 0이면 일시적인 에러로 간주
//         if ((d1 > 1 && d1 <= WALL_DISTANCE_THRESHOLD)
//                   || (d2 > 1 && d2 <= WALL_DISTANCE_THRESHOLD)
//                   || (d3 > 1 && d3 <= WALL_DISTANCE_THRESHOLD)) {
//             failCount++;
//             if (failCount > 5) { // 연속 3회 이상이면 진짜 장애물일 수도 있음
//                 stop_all_motors();
//                 HAL_Delay(50);
//                 if(tempAovoid == 0){
//                    R_avoidance_sequence();
//                    tempAovoid = 1;
//                 }
//                 else{
//                    L_avoidance_sequence();
//                    tempAovoid = 0;
//
//                 }
//                 failCount = 0;
//             }
//         } else {
//             failCount = 0;
//         }
//
//
//         HAL_Delay(100);



